class 楊子謙:
    def SOP_Mainfunction(角色)
        if 角色 == "垃圾角色":
            大談
            被單殺，開始找經典理由
            叫打野
            假裝思考，出一堆垃圾裝備
            開始硬打每波都說差一點
            隊友開始中風，繼續嘻皮笑臉
            開始神遊，各種扣招，不然你要我怎樣
            繼續找理由，經典沒辦法
        else:
            角色不好玩沒爽到，下一把開戳
                
    def 大談(帶錯的天賦):
        分析對手可能會怎麼打
        帶錯天賦
        「這樣帶也可以，還可以啦」
        
    def 叫打野(一大坨小兵):
        if (一大坨小兵 == true):
            先吃個兵不先上
            打野來被反殺死兩個
            「我一大坨兵我不能先上啦」
            
    def 被檢討(超垃圾戰績):
        if 超垃圾戰績 == true:
            「我也沒辦法」
            「你又不幫我」
            「我盡力局」
            「我很認真了」
            「我沒再搞」
            「下把我C」
        else:
            「還可以啦!」
            #實際上是K一堆頭然後蝦雞巴打
    
    def 假裝道歉():
        「開始編造謊言」
        「我以為」
        「我想說」
        「如果...，應該就贏了」
        「假裝理解」#實際上根本沒有
            